//___________Example 1___________________________

const x = 1;
const int y = 2;
final int z = 3;
final q = 4;

//___________Example 2___________________________

final name = 'Anna'; // Без указания типа данных
final String nickname = 'Netti'; // С указанием типа данных

//____________Example 3__________________________
final name = 'Anna'; // Без указания типа данных
final String nickname = 'Netti'; // С указанием типа данных
name = 'Annet'; // Ошибка при попытке изменить значение нашей переменной name

//____________Example 4__________________________

const bar = 1000000; // Единица давления (дин / см2)
const double atm = 1.01325 * bar; // Стандартная атмосфера