// определение функции main

void main (){       // начало объявления функции

          
   print("Hello Dart!");  // вывод строки на консоль

} // конец объявления функции

/*

    многострочный комментарий

    Первая программа

    на языке Dart

*/

/// ( Lama Glama ) является одомашненным южноамериканским верблюдом
///
/// широко используются в качестве мяса и вьючных животных 
/// по андским культурам со временами доколумбовой эпохи .
class Llama {
  String name;

  /// Покормить вашу ламу [Food].
  ///
  /// Типичная лама съедает один тюк сена в неделю.​​​​​​​
  void feed(Food food) {
    // ...
  }

  /// Потренируйте свою ламу с [activity] 
  /// в течении [timeLimit] минут.
  void exercise(Activity activity, int timeLimit) {
    // ...
  }